import random

class Player:
    name = None
    base_hp = None
    hp = None
    mp = None
    power = None
    weapon = None
    armor = None
    item = [None]

    # 상태 출력
    def status(self):
        print("\n상태창")
        print("===================")
        print('= name:',self.name)
        print('= hp:',self.hp)
        print('= mp:',self.mp)
        print('= power:',self.power)
        print('= item:',self.item)
        print("===================")
        
    def equip_weapon(self, weapon):
        if self.weapon is not None:
            print(f"현재 장착중인 무기: {self.weapon.name} (공격력: {self.weapon.min_attack} ~ {self.weapon.max_attack})")
            print(f"새로 장착하려는 무기: {weapon.name} (공격력: {weapon.min_attack} ~ {weapon.max_attack})")
            choice = input("새 무기를 장착하겠습니까? (y/n): ")
            if choice.lower() != "y":
                print("무기 변경을 취소하셨습니다.")
                return
        self.weapon = weapon
        self.power = random.randint(weapon.min_attack,weapon.max_attack)
        print(f"새로운 무기 '{weapon.name}'를 장착하였습니다. 공격력이 {weapon.min_attack} ~ {weapon.max_attack}으로 변경되었습니다.")

    def equip_armor(self, armor):
            if self.armor is not None:
                print(f"현재 장착중인 방어구: {self.armor.name} (체력 증가량: {self.armor.health_increase})")
                print(f"새로 장착하려는 방어구: {armor.name} (체력 증가량: {armor.health_increase})")
                  
                choice = input("새 방어구를 장착하겠습니까?  (y/n): ")
                if choice.lower() != "y":
                    print("방어구 변경을 취소하셨습니다.")
                    return
            self.armor = armor
            self.hp = self.base_hp + armor.health_increase
            print(f"새로운 방어구 '{armor.name}'를 장착하였습니다. 모두 회복하여 체력이 {self.hp}로 변경되었습니다.")

    def attack(self):
        if self.weapon:
            return random.randint(self.weapon.min_attack, self.weapon.max_attack)
        else:
            return self.power

class Weapon:
    def __init__(self, name):
        self.name = name
        if name == "야구방망이":
            self.min_attack = 10
            self.max_attack = 15
        elif name == "마취총":
            self.min_attack = 15
            self.max_attack = 20
        elif name == "리볼버":
            self.min_attack = 20
            self.max_attack = 25
        elif name == "샷건":
            self.min_attack = 20
            self.max_attack = 30
        elif name == "토우 미사일":
            self.min_attack = 30
            self.max_attack = 40
        else:
            print("올바르지 않은 무기 이름입니다.")

class Armor:
    def __init__(self, name):
        self.name = name
        if name == "두꺼운 자켓":
            self.health_increase = 15
        elif name == "체인 메일":
            self.health_increase = 30
        elif name == "EOD 슈트":
            self.health_increase = 60
        else:
            print("올바르지 않은 방어구 이름입니다.")



class Monster:
    def __init__(self, name):
        self.name = name
        if name == "프로케라토사우루스":
            self.hp = 20
            self.attack = random.randint(5, 10)
        elif name == "트리케라톱스":
            self.hp = 30
            self.attack = random.randint(8, 12)
        elif name == "스테고사우루스":
            self.hp = 35
            self.attack = random.randint(10, 15)
        elif name == "갈리미무스":
            self.hp = 30
            self.attack = random.randint(10, 15)
        elif name == "딜로포사우르스":
            self.hp = 35
            self.attack = random.randint(12, 16)
        elif name == "헤레라사우르스":
            self.hp = 40
            self.attack = random.randint(15, 18)
        elif name == "벨로시랩터":
            self.hp = 70
            self.attack = 25
        elif name == "파라사우롤로푸스":
            self.hp = 40
            self.attack = random.randint(20, 25)
        elif name == "시티기몰로크":
            self.hp = 50
            self.attack = random.randint(22, 27)
        elif name == "파키케팔로사우루스":
            self.hp = 60
            self.attack = random.randint(23, 28)
        elif name == "랩터 3마리":
            self.hp = 120
            self.attack = 40
        else:
            print("올바르지 않은 몬스터 이름입니다.")

    def print_ascii_art(self):
        if self.name == "트리케라톱스":
            print(r"""

                        . - ~ ~ ~ - .
      ..     _      .-~               ~-.
     //|     \ `..~                      `.
    || |      }  }              /       \  \
(\   \\ \~^..'                 |         }  \
 \`.-~  o      /       }       |        /    \
 (__          |       /        |       /      `.
  `- - ~ ~ -._|      /_ - ~ ~ ^|      /- _      `.
              |     /          |     /     ~-.     ~- _
              |_____|          |_____|         ~ - . _ _~_-_

              """)

        elif self.name == "스테고사우루스":
            print(r"""
                            .       .
                           / `.   .' \
                   .---.  <    > <    >  .---.
                   |    \  \ - ~ ~ - /  /    |
                    ~-..-~             ~-..-~
                \~~~\.'                    `./~~~/
                 \__/                        \__/
                  /                  .-    .  \
           _._ _.-    .-~ ~-.       /       }   \/~~~/
       _.-'q  }~     /       }     {        ;    \__/
      {'__,  /      (       /      {       /      `. ,~~|   .     .
       `''''='~~-.__(      /_      |      /- _      `..-'   \\   //
                   / \   =/  ~~--~~{    ./|    ~-.     `-..__\\_//_.-'
                  {   \  +\         \  =\ (        ~ - . _ _ _..---~
                  |  | {   }         \   \_\
                 '---.o___,'       .o___,'    

        """)
        elif self.name == "프로케라토사우루스":
            print(r"""
                               ___......__             _
                              _.-'           ~-_       _.=a~~-_
      --=====-.-.-_----------~   .--.       _   -.__.-~ ( ___==>
                    '''--...__  (    \ \\\ { )       _.-~
                              =_ ~_  \\-~~~//~~~~-=-~
                               |-=-~_ \\   \\
                               |_/   =. )   ~}
                               |}      ||
                              //       ||
                            _//        {{
                         '='~'          \\_
                                         ~~'
          """)
        elif self.name == "갈리미무스":
            print(r"""
                                                                                            
                                                                                
     .:~JJ?!.                                                                   
     ~7!!?5PP^                                                                  
          :JGY                                                                  
           ^5P:                                                                 
           .YG?                                                                 
            ~PG?:      .::::...                                                 
             ~5GG5J?7JYPPPPPP5JJ??7!~:....                                      
              .~?YPBGGGGGPPP55YY555YJJ?777?77!~~~^^^^^~^^~~^^::...              
                  :?PGP5PP555555PP5YJ??7?YYYJJJ??7!~~^::.::::^^^^^^:::..        
                    ^!7J5555555PGGP55J??Y5J!~^:..                               
                     :^!J?7JPPPGBBG55JJJ7:.                                     
                   ^?!:.    :J5PGGBGP5J:                                        
                  !Y^         .^~!75GP5?~.                                      
                  ..                !PGP5J~.                                    
                                 :~JJ!:.:~7J7:                                  
                                 ?G7       .?5~                                 
                                 !P:         ^J~                                
                                 .:           :Y!.                              
                                               !P7                              
                                              .!PJ                              
                                              :^:.                              
                                                                               
                                                                
            """)
        elif self.name == "딜로포사우르스":
            print(r"""
             
                                                   ,╓≡╦▒▒▒▒Å▒╠Θ▒▒▒#╦╔.
                                               -⌐"                 "╙╬▒▒▒╦
                                                                       ╙▓▒▒╖
                                                                        └█╣╠⌐
                                                                         ▓▓▒▒
                                                                        ▓█╬▒▒
                                                                      ,▓█╬╠▒▒
                                                                   ,▄╬╬╬╬▒░¼
        ,╓╖╗╗,                                                ╓▄φ▓▓╬╚╩╠░▒░╚
      ▄╬╫╚╟▒╣╬╢φφ▓φ▓▄▄,                           ,╓▄φ#φ▓▓▓╬╬╬╫╝╩╚╠░╙╠φ░╠╩
     ║╬▓╣▓╬╟█╩▓▒▒╣╬╬╣╬╬╬╣φ,               ,╓╗φ▓▓╣╬╩╬╬╣╬╬╬╬╚▒╩╠░╚░░░;y░╔╩
    ▄█▓▓▒░=╙▒▒╚=- ╙▓▒╚5░╠╠╬▓╥         ╓φ▓╬╬╬╬╣╬╣╬╬╫╣╬╙╙╠░╚▒▒░#▐╙⌐í#,#╙
   ╟▓╩╬▒╘┘` ╟▀╚╬╩░║╩▒░,  └░╠╣▓    ╓#▓╬╣╬╠╫▒╫╬╣▓▓╠╣╬▒Ü' ╠▒▄▒╙└-∩▐╦,╣╙
       ,≡▄#╙ ,╦M"╙╙"`╙╙▄╓░ ^╙╬▓▄φ▓╬╫╬╣╬╩╠▒╠╬▓╬╣╠▒▒░'"~:╙║▒,░░Å≤╗╩└
      m,Q≈"`            └╠∩'j╠█▓▓╬▒╬▒▒╬╚╚╡╟▓▓╬▒╠M∩`   ,Φ▒╚░░▄╠╜
                          ╠⌐░╟╬╬▓╬▒░░░░¬▒░╫▓╬╬▒░≥" ¡,╔╬░╠▒▒▓█▌
                           ╠░▓▓▓╩░░▒▒╨,╦░▒▓╬╬▒░ .~░░╠╬▒▒╚▒╫██⌐
                           ╙▓██▒░▒╣░≥░╙▒╠╣█╣╩∩` ¬=▒╣▓▒╠╣▓▓███
                            ╙▓▒░╣▓╬▒░≤╚╩╠▓▓╣▒   ░╠▓█▓▀▓█╬╢╬╬╬,,,
                             ╩ ╫╝▓▓╬╣▒╠╬╣█╬▒ ,▄▒▒╙`   ▓▓╬░╫╬╬╠#╩╩╟╬▓
                            ]╬▒Γ   `╙╙▓███╬╚⌐╩╩Γ║     ╙█╣█╬▒░^,╥╬╬▒╟
                            ╞▒║    ,▄█▀▀ ╙▓▒░└░ `≥     ╙██▓▓▓▓▀╙▌╬▒╠
                            ║░Γ '╟█▀╙     ╫╣▒.'  ╠              ╬▒▒╟
                            ╣╬             ╙╣▒≈  ≤              ╠╬╠▌
                            ▓^               ╙#; '┐            ╔▒╬╬Γ
                            ╙<                 ╙░ ╙≥          ▐╨╫▓╬▓
                                                ▒µ░#            █▓▓╬µ
                                               ╠░╬]            ]█╣▓▒▒
                                              ▐▒╬▓⌐            ║▓╙▓╙▌
                                              ╣╣█▓             ▐▌ ▓ └
                                           ,╓▓█╣▌                 ╙
                                  ,,,;;#▓█████╩╩▒≥=≤≥≥≡»»≈≈==≥ⁿ⌐=ⁿ
            """)
        elif self.name == "헤레라사우르스":
            print(r"""
            
 
     ╔▓▓φ▄▄╗╗▄,                                                   .,╖╖╖▄,
     ▀█▓▓█▓╬▓▓██▓╣▒▓╗╥,       ,╓╖≡╦φφφφφ≡╦╦╦╗╖╖,,,,,,,,,╓╓╖╔φ▒▒▓▓▓▓▓█▀▀▀▀▀█▄
         ¬╙██▓▓███▓▓▓▓╬╬▒▓▓╬╬╬▓▓▓╬╫▓▓╣▓▓██╬▓▓▓▓▓▓▓▓▓▓╣▓▓▓▓▓█████▀▀└        ╟Γ
      ╓▄▄▓▓▓▓▓▓▀▀╨╩▓▓▓▓▓▓▓╬╬╢╣▓▓██╬╣▓╣▓███▓▓▓▓████████████▀▀└              ▐▌
      ╙└¬            ╙▀███▓╣╣████▓╬╬╬▓████▓▓▓▓▓██████▀╙¬                   ▐─
                       └█████████▓▓████████▓▓▓▓███▀¬                       ╟
                         ███████████████████▓▓██▌                          ▌
                         ╣█▌   ▓█▌╙███████▀██████▄
                      ,╗▓╙    ╣▓└  ╙█████   ╙█████▌
                     └▓▓-   ▓▓▀     └████      ╙▀███▌▄
                        ` '▓▀╙        ╙██─         └█▓▌
                                        █▓▄         ╬▓─
                                        ╬▓▀        ,╬█
                               ,,╓,,µ▄▄╣▓█▄▄µ░,¡░░░¡███▄▄▄▄▄▄▄╥╖╓╓╓╓-«»⌐
                     ..≥≥░=≈═ª#≈w╦Q╬╩▓▓▓███▓▓▓╬╬▓╝╣▓╬╬╬╣▓╝╫╬╬Q▒æs≤╓≡---
                      '""5≥≥≥####▒▒▒╩╬╣╝╝╝╩╙╙┘┘7╩░│╙Γ▒░≥?┘░»G░░>"` `
 
            """)
        elif self.name == "벨로시랩터":
            print(r"""
    ╥╗╗▄,
  ╔▓╬▓▓╬▓▓▓▄╓,
 #▓╬╣╣╣╬▓▓▓▓█▓▓▓▓▄
 ██▓▓▓███╬▓▓▓▓▓▓██▓╣▓▓▓▓,
 ╟█████▓▓████▓█▓██▓▓█████▓µ
  ╙██████▓╬███▓▓███▓╣████▓▓
    ▀████████████▓▓╫▓█▓████µ
      ╙██████████████╬▓▓████
        ╙███████████████▓█▓██µ
         ╟██████████████▓╫▓▓██▓
          █████████████▓╣▓╬▓▓▓██▌
           ╙█▓█████████▓╬▓▓▓▓▓█╬█▓
            ╫▓▓▓╬▓▓▓▓▓▓▓▓█▓▓▓██▓╣╣▓▄    ╓▄φφφ╗▄╖
         ,▓▓▓▓█▓▓╣▓███▓▓▓╬▓╣██▓╬╬╬▓▓▓▓▓█▓▓▓╬╬╬╣╣╣▓▓#╗╖,            ,
       ,#▓███▓╣╬▓████▓▓╣╬╣▓█╣▒▌▒╬╣▓▓▓▓█▓▓▓▓╬╣╬╣╬╬▓▓▓▓╬╣╣▓╖,╓▄φ▓▓▓▓▓▓█▓▓▓φ╗╖
      #╣╬█╫▓▓▓█████▓╣╬████▓╬╬╢╬▒▒╬╣╬▓╣▓▓╣▓▓╣╣▓╬╬╣╣▓▓▓▓▓╬╬▓╣▓▓▓▓▓▓▓▓▓▓▀▀╙▀▀▀▀▓▓╖
     ▓╬╬▓▓███████▀▀Γ  '╙██▓▓╬╠▒╠▒╠╬╬╬╣╬▓╬▓╬▓╫╬╬╬╬▓▓▓╬╣╣▓╬╬╬╣▓▓╣▓▓▓▓`
     ╙██████▀▀╙           ▀███╬╩▒▒▒╠╠╠╬╬▓▓▓▓╣╠╬╬╬╣█╬╬╬╬▓╢╬╬╣╬╣▓╣▓▓
                            ╟██▓▒░╠▒╬╬╬╬╣╬▓╣╬╬╬╬╬╬╣▓╬╬╬╠╬╬╬╬▓╣╣╬╩
                            ╫██▓█▒╠╩╠▒╬╠╠╬╬╬╬╬╬╬╬╬╢╬╬╣╣╬╬╬╬╬╣╬╬▓
                            ███▓╣█▒▒╠▒╠╩╠╬╠╠╢╠╬╣╬╬╬╣╬╬╣╬╣▓▓╬╬╣╬╣▒
                            ╙█████╬╠╟╬╬╬▒▒▒╠╠▒╬╬█▓▓▓▓▓█▓▓╬▓╬╬╣▓╬▌
                              └╙████▒▒╬╬╬╠╬▒╬╬▓▓▓▓╬███╬╬▓╬██▓╬▓╬╬L
                                 ╙███▓╠╠╬╬╬╬▓╠╫╬▓▓▓█▓╣▓╬████▓╬╣╬╣Γ
                                  ███████████╬▓▓██▓▓╬███▀ ╚██▓╬▓▓Γ
                                  ▐██████████▀ @█▓█▌ █     ██▓╬▓█▓
                                  ╟█▓▓████████▄╫███▓▐█▌    ▐██▓▓█╣▓
                                  └████▓▓▒╠████████▓╬▓▓╬   "███▓▓▓▓Γ
                                    ▀█████▓██████████▓█╬    ╙██▓▓▓▓Γ
                                      ▀██████████████▀▀╙     █████▓
            """)
        elif self.name == "파라사우롤로푸스":
            print(r"""
      ╓╖╗φφ▄▄╓,
   ▓▓╝▀▀╝╣╬▓▓▓▓▓▒≥,
           ╚╬▓▓╬▓▓▓╬φ
           ,▓▓╬╣▓▓▓╬╣╢▓
           ╣▓╬╬╠╫▓▓╬▓▓▓╣╕
          ╞▓▓╬╬╣▓╬╬╬╬▓╢▓▀
          ╘╠╣▓▓▓▓▓▓╠,,╓▄╗╦╖,
           ╬╬╬▓███╬╬╬╠╫╬╬╬╬╬╬╬φ,
           ╚╬╬▓████▓╬╬╬╣╬╬╣╬╬╬╬╬╬╬╣▒╗,
            ╣╬▓██████▓▓▓▓╣▓▓▓╬╣╬╣▓╬╬╣╬╬▒╓
            ┌╣╬▓█████▓╬╬╬╣╬▓╬╬╬╬╣▓▓▓▓╬╬╬╬╬▒
            ╠╣╫╬▓██▓█▓█▓▓▓▓▓▓▓╬╬╣████╬╬╣╬╬╬╬╦
            ╚╬╬╬╣▓▓▓▓▓▓█▓╬█████▓████▓▓╣╣╬╬╬╣╬╬,
             ╚╬╣╣▓▓▓█▓▓▓▓▓▓███████▓█▓▓▓▓▓╬╣╣▓╬╬▒
              ╟╣▓▓▓▓███▓▓▓╬▓██████▓▓▓▓▓▓▓▓╣▓█▓▓╬╣▄
            ╔▓██▓▓▓██▓█▓▓██████████████▓▓▓████▓▓▓╬▓,
            ▓▓▌╠▓█▌ └╙▀▀▀▓████████▓▓███▓█████████▓▓╬▒
           ⌠▓▓▌             ╫███▓███▓██▀▀▀█████████▓▓╬φ
            └               ╟██╣███▓Γ└      ╙████████▓╣╬▒,
                            └▓█╣▓▓▓▓▓          ╙▀███████▓▓╣▒╦,,
                              ╙╣█▓███▓╓            ╙▀█████▓▓▓▓▓╬╣▓╣▓▓▓▓▓▓▀▀└
                               ╫██▀▓███▓▄              ╙╙▀▀███████▀▀▀╙─
                              ║▓▓▓   └███Γ
                             ╓╣██╜    ╣▓█
                            ╔▓█▌     )▓█▌
                          ▄▓█▓╬Γ  ,▄▓█▓▓⌐
                         └╙╙╙╙▀
            
            """)
        elif self.name == "시티기몰로크":
            print(r"""
                                                   ,
                                                  ▓▄,
                                                   ╚█▓╦,  ▐▓
                                                    ╙████▓╬╬▌ ╣, ╓╖╗╗╔,
                                                  ▓▄, ╙████▓▓▓╬╬╬╣╣▓╬▒▒▒░≥
                                                   ╙▀█▓▓███████▓▓▓╬▓▓▓▓╣╬╬▒≥
                                                      └▀▀███████████▓╬╣╣╬╬╬╠µ
                                                        ^▓████████████╬╣╣╣╣╬▒
 ,╓▄▄φ▓▓▓▓▓▓▓▓╬╬▓▓▓φ▄,                                 φ,▓██████████▓█▓╣╣╬╬╣╠╣
 └╙╙▀▀▀▀▀▀▀▀▀▀█▓████▓▓▓▓φ╖                             ,▓██▓█▓▓█████▓███▓█▌╫╬▀
                ╙▀███▓▓▓▓▓▓▓φµ        ,╓╖╦╦▄▄▄╓╓╗▄φ▓▓▓╬▓██▓██████████▓███▓▓▓╬▒
                   ╙▀▓██▓▓▓▓▓▓▓▓▓▄,╔Φ▓▓▓▓▓▓╬╣▓▓██▓╬╬▓▓▓█▓▓╬▓██████▓▓██▓▓██▓╣▓▓▓
                      ╙╣▓▓╬▓▓▓▓╬╬▓▓╣▓▓███╬▓▓╣▓╬▓▓╬▓▓█▓╬╬▓▓▓▓╣▓██▓▓▓▓╬▓▓╣█▓▓▓▓▓
                        └╫▓▓▓╬╬▓▓▓▓▓▓██▓▓╬▓▓▓▓▓╣╣▓██▓▓▓▓██████▓╬╬▓╣╬▓▓█▓█▓█▓▓▓
                          └▓▓╬▓▓▓▓████╬▓▓▓▓██▓▓▓▓██▓█▓▓█▓███████╝▓▓╣▓████▓▓╬╩
                            ▀▓▓▓█████▓████████▓███████████████▓⌐  "▓█████▀╙
                            ▓▓███████▓▓▓▓████▓███████████▓▓██╬▓⌐    ╙╣╬█▌
                           ║▓███████▓▓█▓█▓█▓████████████▓██▓╬▓▓
                          ╦▓███████▓╬▓▓▓╣▓██████████▓█████████▌
                         ╔███████▀█████╫█████████████████████▌
                         ▓██████  ╙██████▓▓██▓█████████▀████▀
                         █████▀        └╙███████████   ▄████
                        ╒████Γ            █████████   ▓▓╣╣╜
                        ╣████`         ,é╬▓███████Γ   "╙▀╙
                       @█████         ▄▓▓▓██████╜
                      Φ▓████▓        ╣▓███████▀
                    ,▓████▌╫Γ       ╓╣▓█████▀
                   ▄██████▌       ,Φ▓▓███▀
                  ╟███████       ╣▓▓███▌
                   ╙███╘█▓      ╣█████Γ         
            """)
        elif self.name == "파키케팔로사우루스":
            print(r"""
                                                            ╓╗φφ╦╖
      *╖                                               ,╓╟╠╩╩░╠▒╠╕
        └Φ╗╖,              ,,╓╓╓▄▓▓▓▓▓╬╗╦              ▓▓▓▓╠▒▒░░Γ▒
           ╙╩╠╬╣▓▓▓▓▓▓▓▓▓╬╬╬╬▓▓▓▓╬╣╣╣▓╬╬╣╣▓φ╦,        φ╬╬╬█▓▓▓▓▓╩╩╩▒,
              `╚╠╚╠╣╬╬╬▓╬╬╬╬▓╬╢╬╬╬╣╬╬╬╫╬╟╬╣╣╬╬▓▓╗,,m▓╬╠╠▒║╬╬╬╩╬╫╣▒▒▒╣▌
                  `²░░╙╠╠╬╢╣╬╬╬╣╬╬╬╠▒╩╩╬▒╬╬▒▒╣╬╬╬╬╬╣╬▒╠╢╬╣╬▓▓▓╝╜╙╨╝╝▀
                       "=▒╟╬╬╣╬╬╬╬▒▒░└░░▒░░░╠╬╬╬╠╩╠╬╬╢╬╬╢▓▀╙
                          ^▓╣▓╬╬╣╬╣▒░∩..;░ÇÇ░▒▒╠╠╬╠╬▓▓▓▀─
                           ╚╬╬╬║╬▓╣╬░≤-≡╠╣▓╣╬▒▒╠╬╬╣╣█▀└
                            ╢╬╬╠╬╣▓╬,.,]╣╣▓╬▓▓███▓▀╙
                            ╞╣▒╠╣▓▓▓▓▓▓╬╠╬██╝╨╨╙╚█
           '..             @╬▓╬▓█▓▓███▀└╙╬      j╝
              ''░.         ╣╫▓▓█\╩▓█└   ¡║Γ    ,╨
                  '''░..  ,╠╣▓▀  ░╠╩    ╠╝'    '
                     ''   Ü╚╣∩..  j╠
                        ' ^ "╙   ^░▒▒=Q,.
                          '!░7╬╦' ╙╩Å╚▀╙'     ''░░'...
                            ╠▒╠▒╠╗¿''                       ░
                             ╙  ╙`    ''            ''     ''''
 
           
            """)
        elif self.name == "랩터 3마리":
            print(r"""
               ▀██▓▄,
                ▀████▄
                  ╙████▓▄                                   ,,
                    ╙██████▄                         ╓▄▒▒░░░Å▒▒
                      ╙██████▓▄                      ██████▓╬╬╬╣
                        ╙███████▓╥                  ║██████▓▓█▓╣▓
                          ╙███████▓▄                ▓▓╣▓▓██████▓▓b
                           └█████▓█▓╣▓╖             ███╬╣▓▓▓▓▓███¬
                             ╙███▓╬▓▓▓╬╣╬#╖,        ╫█████▓███╙└
                              └██▓▓▓▓█▓▓▓╬▒▒╠╬╬▒╗,  ╟█████████
                                ╙██▓██▓╣▓╬╣▓▒╠╣▓╬╬╬#╣█████████
                                  ██▓█▓▓▓▓╬╬╣╣▓╣╬╬╬╬▓█████████
                                   ╙▓▓▓▓▓▓▓██▓▒╣╣▓▓███████████
       ,-;≤≥░░░░░                   ╫▓▓╣▓████▓▓╣╬▓███████████▌
      ╟██████▓╣▒▒╠▓▄╓               ▐▓▓▓▓████▓▓▓▓█████████████
      ▓██████▓▓█▓╣▓█╣▓▓╦             ▓█████████████████████████   ,╓≡╔▄▒▒╠╬▒▒µ
     ╣█████████████`└╙█▓▓▓╓          ╟██████▓█████▓▓███████████   ▓████████▓╣╣▓
     █▓▓████████╬╣▓▓   ╙██▓▓╦         ██████▓██████████████████   ███████████▓██
     ███▓▓███▓█▓███▀     ▀███▓▓╖      ╟████████████████████▀██▌  ╟██████████████
     ████▓███████▀`        ▀████▓╗   ╔╫████▓███████████████ ██▌  ▓▓▓███▓█▓█████▌
     ███████████            └▓███▓▓▓φ╬███████████████▀▀██▀▀ ██▌  ███▓▓█████████
 ,φ▓▓███████████              ╙█▓█▓▓▓▓╬█████▌ ╟██▌███▓     ]███ ▐███████████╙
▓▓█▓████████████                ╙█▓███╣╬╬╬╬   ╟███▓████▄  ▐████─╫██████████▌
╣▓█╣████████████▄                 █▓████╬╬╬▒╗╓████████▓██▄ ─╙`  ╫██████████▌
█▓█▓██████████████▄                ╙█▓▓╬▓▓▓╣╣╬╬╬╣▓█████╬▓██▓   ╓███████████Γ
█▓█╬███████████████⌐                 ▓█▓╬╬▓█▓▓▓╬╬╬╬╬╬╠╠╬╬╣▓▓╬▓▓▓███████████⌐
██████████████████▌                  └███╬▓▓▓███▓▓▓╣▓▓▓╬▓╬╣▓▓╫▓▓███████████▌
█████████████████▀                     ▀███▓▓▓▓╣▓█╬▓▓▓████▓╬▓╬██████████████▓▓
████████████████▌                       ▀▀▀▓█▓╣▓▓▓▓██████▓▓╢▓▓▓███████████████▓           
            """)
          
def battle_menu():
    #이 곳에 몬스터의 아스키 아트를 띄우면 계속 메뉴와 함께 나올 듯.
    #체력에 따라서 몬스터의 모양이 변한다면? ex) 50% 이하이면 문자 몇 개를 제거하여 상처입은 것을 표현
      print('1. 공격하기              ',end='')
      print('2. 회복아이템')
      print('3. 후퇴하기 (10% 확률)  ',end='')
      print("이외) 가만히 있는다.")
      select=input('다음에 할 행동은? ')
      return select

def user_attack(usrname, usratk, mobname, mobhp):
    print(f"{usrname}의 공격!")
    i = random.randint(1, 10)
    if i <= 3:
        damage = usratk
        print("일반 공격 성공!")
    elif 3 < i < 8:
        damage = int(usratk * 1.5)
        print("크리티컬!")
    else:
        damage = usratk * 2
        print("크리티컬!!!!")
    mobhp -= damage
    if mobhp <= 0:
        print(f"{mobname}에게 {damage}의 데미지를 입혔습니다!\n")
        return False
    else:
        print(f"{mobname}에게 {damage}의 데미지를 입혔습니다!\n")
    return mobhp

def mob_attack(mobname, mobatk, usrname, usrhp):
    print(f"{mobname}의 공격!")
    i = random.randint(1, 10)
    if i <= 3:
        damage = mobatk
        print("일반 공격 성공!")
    elif 3 < i < 8:
        damage = int(mobatk * 1.5)
        print("크리티컬!")
    else:
        damage = mobatk * 2
        print("크리티컬!!!!")
    usrhp -= damage
    if usrhp <= 0:
        print(f"{mobname}에게 {damage}의 데미지를 입혔습니다!\n")
        return False
    else:
        print(f"{usrname}은(는) {damage}의 데미지를 입었습니다.\n")
    return usrhp

def battle(usrname, usrhp, usratk, mobname):
    monster=Monster(mobname)
    mobhp=monster.hp
    mobatk=monster.attack
    print(f'{mobname}과의 전투가 시작되었습니다!') #전투 시작 문구
    while usrhp > 0 and mobhp > 0:
        monster.print_ascii_art()
        print(f"'{usrname}' \n체력: {usrhp}, {mobname} 체력: {mobhp}") #매 턴 보여줄 스테이터스
        action = battle_menu()
        if action == "1":
            mobhp = user_attack(usrname, usratk, mobname, mobhp)
        elif action == "2":
            print("회복 아이템을 사용합니다.") #추후 아이템 리스트를 보여주고 사용하는 식으로 보완
            usrhp += 50
            if usrhp > 100:  #최대 HP를 넘기지 않도록
                usrhp = 100
            print(f"{usrname}의 체력이 {usrhp}가 되었습니다.")
        elif action == "3":
            randomint=random.randint(1,10)
            if randomint<2:
              print("\n전투에서 도망쳤습니다...\n")  #후퇴 문구
              break
            else:
              print("\n도망가지 못했다!\n")
              print(f"\n{mobname}이 공격합니다.\n")
        if mobhp > 0:
          usrhp = mob_attack(mobname, mobatk, usrname, usrhp)
    if usrhp <= 0:
        print(f"{usrname}은(는) 사망했습니다...")
        if contin()==1:
            usrhp=100
        #사망 문구
    elif mobhp <= 0:
        print(f"{mobname}을(를) 물리쳤습니다!")  #승리 문구
    return usrhp

def contin():
    sel=input('계속 하시겠습니까(y/n)')
    if sel=='y':
        return 1
    else:
        quit()
      
      